EDT/УТ/src/DataProcessors/ПривязкаАдресовDaData/ПривязкаАдресовDaData.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПривязкаАдресовDaData</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/РаспознаваниеАдресовDaData/РаспознаваниеАдресовDaData.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспознаваниеАдресовDaData</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>АдресДо</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>АдресПосле</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Качество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.новаАдреса</types>
    </type>
  </resources>
  <resources>
    <name>Регион</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>НаселенныйПункт</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Улица</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Корпус</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/новаАдреса/новаАдреса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаАдреса</name>
  <attributes>
    <name>ВходитВКлассификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.новаСтраны</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.новаРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Район</name>
    <type>
      <types>CatalogRef.новаРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НаселенныйПункт</name>
    <type>
      <types>CatalogRef.новаНаселенныеПункты</types>
    </type>
  </attributes>
  <attributes>
    <name>Улица</name>
    <type>
      <types>CatalogRef.новаУлицы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИмеетКоординат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшКоординат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаИнтереса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТочкиИнтереса</name>
    <type>
      <types>CatalogRef.новаТипыТочекИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТочкиИнтереса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособГеокодирования</name>
    <type>
      <types>EnumRef.СпособыГеокодирования</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаТочкиДоставки/новаТочкиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаТочкиДоставки</name>
  <attributes>
    <name>ВладелецТочки</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.новаАдреса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребывания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаПланирования</name>
    <type>
      <types>CatalogRef.новаСменыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособыДоставкиЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПосещения</name>
    <type>
      <types>CatalogRef.новаРежимыПосещенияТочекДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Радиус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗонПогрузкиРазгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахождениеТранспортаВРадиусе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.новаПриоритетыТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИзЯндекса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Москва</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикРаботы</name>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПребывания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъемВывоза</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.новаНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <types>CatalogRef.новаЕдиницыНоменклатуры</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/ПривязкаАдресовDaData/ObjectModule.bsl
Процедура ВыполнитьПривязкуАдресов() Экспорт
	Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		|	новаМестнаяДоставка.Номер КАК НомерЗаказа
		|ИЗ
		|	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспознаваниеАдресовDaData КАК РаспознаваниеАдресовDaData
		|			ПО РеализацияТоваровУслуг.Ссылка = РаспознаваниеАдресовDaData.Заказ.Ссылка
		|		ПО новаМестнаяДоставка.Номер = РеализацияТоваровУслуг.Номер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.новаАдреса КАК новаАдреса
		|		ПО новаМестнаяДоставка.ТочкаПрибытия.Адрес.Ссылка = новаАдреса.Ссылка
		|ГДЕ
		|	новаМестнаяДоставка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И (ЕСТЬNULL(новаАдреса.Широта, 0) = 0
		|			ИЛИ ЕСТЬNULL(новаАдреса.Долгота, 0) = 0)
		|	И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
		|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
		|	И ЕСТЬNULL(РаспознаваниеАдресовDaData.Период, ИСТИНА) = ИСТИНА";
		Зап.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНачала));			
		Зап.УстановитьПараметр("ДатаКон", КонецДня(ДатаОкончания));			
	Иначе
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		|	новаМестнаяДоставка.Номер КАК НомерЗаказа
		|ИЗ
		|	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспознаваниеАдресовDaData КАК РаспознаваниеАдресовDaData
		|			ПО РеализацияТоваровУслуг.Ссылка = РаспознаваниеАдресовDaData.Заказ.Ссылка
		|		ПО новаМестнаяДоставка.Номер = РеализацияТоваровУслуг.Номер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.новаАдреса КАК новаАдреса
		|		ПО новаМестнаяДоставка.ТочкаПрибытия.Адрес.Ссылка = новаАдреса.Ссылка
		|ГДЕ
		|	 РеализацияТоваровУслуг.Номер = &НомерЗаказа";
		Зап.УстановитьПараметр("НомерЗаказа", НомерЗаказа);			
	КонецеСли;
	
	Рез = Зап.Выполнить();
	
	Если Рез.Пустой() Тогда
		Сообщить("Нет данных для привязки!", СтатусСообщения.ОченьВажное);
		Возврат
	КонецЕсли;	
	
	Выб = Рез.Выбрать();
	
	Прокси =  WSСсылки.FrontDelivery.СоздатьWSПрокси("http://tempuri.org/","Service1C","BasicHttpBinding_IService1C");
	
	Фабрика = Прокси.ФабрикаXDTO;    
	
	Тип_orders = Фабрика.Пакеты.Получить("http://schemas.microsoft.com/2003/10/Serialization/Arrays").Получить("ArrayOfint");
	orders = Фабрика.Создать(Тип_orders);
	
	
	Пока Выб.Следующий() Цикл
		Попытка
			orders.int.Добавить(Число(Выб.НомерЗаказа));
		Исключение
			
		КонецПопытки;	
	КонецЦикла;	
	
	Рез = Прокси.AddressSuggest(orders);
	
	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("АдресПосле", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(500)));
	Таб.Колонки.Добавить("Широта", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(20, 13)));
	Таб.Колонки.Добавить("Долгота", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(20, 13)));
	Таб.Колонки.Добавить("Качество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(2)));
	Таб.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Таб.Колонки.Добавить("НомерЗаказа", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(11)));
	
	
	Таб.Колонки.Добавить("Страна", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));
	Таб.Колонки.Добавить("Регион", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Таб.Колонки.Добавить("НаселенныйПункт", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	Таб.Колонки.Добавить("Улица", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	Таб.Колонки.Добавить("Дом", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10)));
	Таб.Колонки.Добавить("Корпус", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10)));	
	
	МомВремени = ТекущаяДата();
	//+Степанов Берем только первый адрес
	//Для Сч = 0 По Рез.AddressSuggest.Количество() - 1 Цикл
	Если Рез.AddressSuggest.Количество() > 0 Тогда
		Сч = 0;
		СтрокаДанных = Рез.AddressSuggest[Сч];
		Нов = Таб.Добавить();
		Нов.НомерЗаказа = Формат(СтрокаДанных.OrderID, "ЧГ=");
		Нов.Широта = СтрокаДанных.Geo_lat;
		Нов.Долгота = СтрокаДанных.Geo_lon;
		Если ЗначениеЗаполнено(СтрокаДанных.Qc_geo) Тогда
			Нов.Качество = Число(СтрокаДанных.Qc_geo);
		Иначе
			Нов.Качество = -1;
		КонецеСли;	
		Нов.АдресПосле = СтрокаДанных.Value;
		Нов.Период = МомВремени;
		Нов.Страна = "Россия";
		Нов.Регион = СтрокаДанных.Region;
		Нов.НаселенныйПункт = СтрокаДанных.Settlement;
		Нов.Дом = СтрокаДанных.House;
		Нов.Корпус = СтрокаДанных.Block;
	КонецЕсли;
	//КонецЦикла;
	//-Степанов
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	|	Таб.АдресПосле,
	|	Таб.Широта,
	|	Таб.Долгота,
	|	Таб.Качество,
	|	Таб.НомерЗаказа,
	|	Таб.Период,
	|	Таб.Страна,
	|	Таб.Регион,
	|	Таб.НаселенныйПункт,
	|	Таб.Улица,
	|	Таб.Дом,
	|	Таб.Корпус
	|ПОМЕСТИТЬ ВТ_таб
	|ИЗ
	|	&Таб КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_таб.АдресПосле,
	|	ВТ_таб.Широта,
	|	ВТ_таб.Долгота,
	|	ВТ_таб.Качество,
	|	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	|	ВТ_таб.Период,
	|	ВТ_таб.Страна,
	|	ВТ_таб.Регион,
	|	ВТ_таб.НаселенныйПункт,
	|	ВТ_таб.Улица,
	|	ВТ_таб.Дом,
	|	ВТ_таб.Корпус
	|ИЗ
	|	ВТ_таб КАК ВТ_таб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_таб.НомерЗаказа = РеализацияТоваровУслуг.Номер";
	Зап.УстановитьПараметр("Таб", Таб);
	
	Рез = Зап.Выполнить().Выгрузить();
	Набор = РегистрыСведений.РаспознаваниеАдресовDaData.СоздатьНаборЗаписей();
	
	Набор.Отбор.Период.Установить(МомВремени);
	
	Набор.Загрузить(Рез);
	
	Набор.Записать(Истина);
	
	
	Зап = Новый Запрос;
	
	Зап.Текст = "ВЫБРАТЬ
	            |	новаТочкиДоставки.Ссылка КАК ТочкаДоставки,
	            |	РаспознаваниеАдресовDaData.Заказ.Ссылка КАК Заказ,
	            |	РаспознаваниеАдресовDaData.Широта КАК Широта,
	            |	РаспознаваниеАдресовDaData.Долгота КАК Долгота,
	            |	РаспознаваниеАдресовDaData.Регион КАК Регион,
	            |	РаспознаваниеАдресовDaData.НаселенныйПункт КАК НаселенныйПункт,
	            |	РаспознаваниеАдресовDaData.Улица КАК Улица,
	            |	РаспознаваниеАдресовDaData.Дом КАК Дом,
	            |	РаспознаваниеАдресовDaData.Корпус КАК Корпус,
	            |	""Россия"" КАК Страна,
	            |	РаспознаваниеАдресовDaData.АдресПосле КАК АдресПосле,
	            |	РаспознаваниеАдресовDaData.Заказ.ТерминалДоставки.Код КАК ТерминалДоставкиКод,
	            |	РаспознаваниеАдресовDaData.Заказ.Номер КАК НомерЗаказа
	            |ИЗ
	            |	Справочник.новаТочкиДоставки КАК новаТочкиДоставки
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспознаваниеАдресовDaData КАК РаспознаваниеАдресовDaData
	            |			ПО (РаспознаваниеАдресовDaData.Заказ.Номер = новаМестнаяДоставка.Номер)
	            |		ПО новаТочкиДоставки.Ссылка = новаМестнаяДоставка.ТочкаПрибытия.Ссылка
	            |ГДЕ
	            |	РаспознаваниеАдресовDaData.Период = &Период
	            |	И РаспознаваниеАдресовDaData.Качество <> -1
	            |	И РаспознаваниеАдресовDaData.Качество <= 1";
	Зап.УстановитьПараметр("Период", МомВремени);			
	//Код qc_geo Описание
	//0 Точные координаты
	//1 Ближайший дом
	//2 Улица
	//3 Населенный пункт
	//4 Город
	//5 Координаты не определены	
	
	//Асеев 14.10.2022 (Задача № 4913)>>>
	МассивЗаказовЗон = Новый Массив;
	//Асеев 14.10.2022 (Задача № 4913)<<<
	
	Кол = 0;
	Рез = Зап.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Т = Рез.ТочкаДоставки.ПолучитьОбъект();
		А = Справочники.новаАдреса.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(А, Рез);
		А.Наименование = Рез.АдресПосле;
		А.НаименованиеТочкиИнтереса = Рез.АдресПосле; // определившийся адрес для выгрузки в админку
		А.ВходитВКлассификатор = Ложь;
		Попытка
			А.Записать();
		Исключение
			
			А.УстановитьНовыйКод("А");
			А.Записать();
		Конецпопытки;
		Т.Адрес = А.Ссылка;
		Т.Записать();
		
		
		Набор = РегистрыСведений.РаспознаваниеАдресовDaData.СоздатьНаборЗаписей();
		
		Набор.Отбор.Период.Установить(МомВремени);
		Набор.Отбор.Заказ.Установить(Рез.Заказ);
		Набор.Прочитать();
		
		Набор[0].Адрес = А.Ссылка;
		
		Набор.Записать(Истина);
		
		//mel установка полигонального адреса 08.02.2018
		Если Рез.ТерминалДоставкиКод = 1 Тогда
			Если ЗначениеЗаполнено(СокрЛП(Рез.Долгота)) И ЗначениеЗаполнено(СокрЛП(Рез.Широта)) Тогда
				МассивСтрук = Новый Массив;
				
				Струк = Новый Структура;
				
				Струк.Вставить("НомерЗаказа", Число(Рез.НомерЗаказа));
				Струк.Вставить("Широта", Рез.Широта);
				Струк.Вставить("Долгота", Рез.Долгота);
				МассивСтрук.Добавить(Струк);
				
		//+Широков 24.12.2020 по письму
				//ПолигональнаяМаршрутизацияСервер.ПолучитьПолигоныЗаказов(МассивСтрук);	
				ПолигональнаяМаршрутизацияСервер.ПолучитьПолигоныЗаказов(МассивСтрук, Неопределено, "Обработка.ПривязкаАдресовDaData.ВыполнитьПривязкуАдресов (236, 5)");	
		//-Широков 24.12.2020 по письму
		
				//Асеев 14.10.2022 (Задача № 4913)>>>
				МассивЗаказовЗон.Добавить(Рез.Заказ);
				//Асеев 14.10.2022 (Задача № 4913)<<<
		
			КонецеСли;
		КонецеСли;
		//mel установка полигонального адреса 08.02.2018
		
		
		Кол = Кол + 1;
	КонецЦикла; 
	
	//Асеев 14.10.2022 (Задача № 4913)>>>
	ТарификацияУслугСервер.УстановитьЗонуЗаказов(МассивЗаказовЗон);
	//Асеев 14.10.2022 (Задача № 4913)<<<
	
	#Если Клиент Тогда
		
		Если Кол <> 0 Тогда
			
			Сообщить("Привязка выполнена! Количество привязанных адресов " + Строка(Кол), СтатусСообщения.Внимание);
		Иначе
			Сообщить("Привязка не выполнена! Кривые адреса!", СтатусСообщения.Внимание);
		КонецеСли;	
	#КонецЕсли
КонецПроцедуры
